In [4]:
import pandas as pd
import numpy as np
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)
sozluk={"var1":s1,"var2":s2,"var3":s3,}
sozluk

{'var1': array([4, 5, 3, 9, 9]),
 'var2': array([9, 5, 7, 5, 0]),
 'var3': array([0, 7, 7, 8, 9])}

In [72]:
df=pd.DataFrame(sozluk)
df

   var1  var2  var3
0     4     9     0
1     5     5     7
2     3     7     7
3     9     5     8
4     9     0     9

In [73]:
df[:2]

   var1  var2  var3
0     4     9     0
1     5     5     7

In [74]:
df.index=["a","b","c","d","e"]

In [75]:
df

   var1  var2  var3
a     4     9     0
b     5     5     7
c     3     7     7
d     9     5     8
e     9     0     9

In [76]:
#silme işlemi
df.drop("d")

   var1  var2  var3
a     4     9     0
b     5     5     7
c     3     7     7
e     9     0     9

In [77]:
#ama gerçek df de a satırı silinmez
df

   var1  var2  var3
a     4     9     0
b     5     5     7
c     3     7     7
d     9     5     8
e     9     0     9

In [78]:
df.drop("c",axis=0,inplace=True)
df

   var1  var2  var3
a     4     9     0
b     5     5     7
d     9     5     8
e     9     0     9

In [80]:
#silme şu şekildede olabilir |||FANCY
l=["a","e"]
df.drop(l,axis=0)
#kalıcı silme değildirrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr

   var1  var2  var3
b     5     5     7
d     9     5     8

In [81]:
df

   var1  var2  var3
a     4     9     0
b     5     5     7
d     9     5     8
e     9     0     9

In [85]:
l=["a","b",4,5,"var1"]
for i in l:
    print(i in df)
df

False
False
False
False
True

   var1  var2  var3
a     4     9     0
b     5     5     7
d     9     5     8
e     9     0     9

In [ ]:
df = q1_fisher_r[(q1_fisher_r['TP53']==1) & q1_fisher_r['TumorST'].str.contains(':1:')]
df = q1_fisher_r[(q1_fisher_r['TP53']==1) & q1_fisher_r[(q1_fisher_r['TumorST'].str.contains(':1:'))]]

In [93]:
#normalde köşeli parantez verince var olan inise gitmek istediğimizi anlardı python. Fakat
#burada bu indis olmadığından, bunu oluşturmak olarak algılar 

df["var4"]=df["var1"]*df["var2"]
df

   var1  var2  var3  var4
a     4     9     0    36
b     5     5     7    25
d     9     5     8    45
e     9     0     9     0

In [94]:
#değişken silme
df.drop("var4",axis=1)

   var1  var2  var3
a     4     9     0
b     5     5     7
d     9     5     8
e     9     0     9

In [95]:
df

   var1  var2  var3  var4
a     4     9     0    36
b     5     5     7    25
d     9     5     8    45
e     9     0     9     0

In [97]:
#değişkeni kalıcı şekilde silmek için,
df.drop("var4",axis=1, inplace=True)

In [92]:
df

   var1  var2  var3
a     4     9     0
b     5     5     7
d     9     5     8
e     9     0     9